[
    {
        "company": "Levitate",
        "title": "Full-Stack JavaScript Developer",
        "startDate": "01 June 2020",
        "endDate": "Present",
        "description": [
            "I work across modern websites and web applications, building full-stack solutions with a strong focus on front-end architecture and user experience. In a small, fast-moving team, I regularly switch between projects, define technical approaches, and deliver production-ready builds using modern JavaScript frameworks and tooling.",
            "My role has evolved into helping drive the adoption of newer technologies and workflows, including modern build tooling, component-driven development, and performance-focused front-end practices. I enjoy working at the intersection of design and engineering, turning ideas into fast, scalable and maintainable products.",
            "Working in a versatile environment has allowed me to develop a broad technical skillset while building a reputation as someone who can adapt quickly, learn fast, and deliver high-quality work across a range of projects."
        ],
        "skills": [
            "Next.js",
            "Astro",
            "TypeScript",
            "JavaScript",
            "HTML",
            "SCSS/Sass",
            "PostgreSQL",
            "Vite",
            "Headless (Shopify & WordPress)"
        ],
        "tools": [
            "Cursor",
            "Figma",
            "Adobe XD",
            "Git",
            "Asana",
            "Slack"
        ],
        "infrastructure": [
            "Digital Ocean",
            "Vercel",
            "Cloudflare",
            "Google Cloud"
        ],
        "soft-skills": [
            "Technical planning",
            "Project ownership",
            "Mentoring",
            "Communication",
            "Problem solving",
            "Adaptability",
            "Attention to detail"
        ],
        "key-responsibilities": [
            "Led the adoption of modern JavaScript tooling across the company's workflow, introducing Vite and GitHub-based collaboration to replace legacy build processes and significantly improve developer experience.",
            "Design and build front-end architectures using Next.js, Astro and modern CSS/Sass systems, focusing on performance, scalability and maintainability.",
            "Define technical approaches and recommend stacks based on project needs, often combining headless or hybrid CMS solutions with modern frameworks.",
            "Act as a bridge between modern frontend frameworks and CMS platforms, enabling teams to deliver fast, flexible and future-proof websites.",
            "Support and mentor developers, encouraging clean architecture, component-driven development and performance-focused best practices."
        ],
        "key-achievements": [
            "Developed a reusable front-end foundation using design tokens and CSS variables, enabling consistent UI patterns and rapid project setup across multiple builds.",
            "Reduced front-end development time by 30-40% through a pre-optimised, responsive base architecture and reusable component patterns.",
            "Successfully modernised the company's front-end workflow by migrating to Vite, dramatically reducing build times and improving iteration speed.",
            "Delivered high-performance websites using modern rendering approaches and component-driven development.",
            "Continued to maintain and modernise existing WordPress projects while progressively introducing more modern, headless and framework-driven approaches."
        ]
    }
]